# -*- coding: utf-8 -*-
offset = 0x0980

rev_code = {
    0x981 : "M", #  ঁ
    0x982 : "x", #  ং
    0x983 : "X", #  ঃ
    0x985 : "a", #  অ
    0x986 : "A", #  আ
    0x987 : "i", #  ই
    0x988 : "I", #  ঈ
    0x989 : "u", #  উ
    0x98A : "U", #  ঊ
    0x98B : "WR", #  ঋ
    0x98C : "WD", #  -
    0x98D : "WA", #  -
    0x98E : "e", #  -
    0x98F : "E", #  এ
    0x990 : "YE", #  ঐ
    0x991 : "WO", #  -
    0x992 : "o", #  -
    0x993 : "O", #  ও
    0x994 : "YO", #  ঔ
    0x995 : "k", #  ক
    0x996 : "K", #  খ
    0x997 : "g", #  গ
    0x998 : "G", #  ঘ
    0x999 : "z", #  ঙ
    0x99A : "c", #  চ
    0x99B : "C", #  ছ
    0x99C : "j", #  জ
    0x99D : "J", #  ঝ
    0x99E : "Z", #  ঞ
    0x99F : "T", #  ট
    0x9A0 : "HT", #  ঠ
    0x9A1 : "D", #  ড
    0x9A2 : "HD", #  ঢ
    0x9A3 : "N", #  ণ
    0x9A4 : "t", #  ত
    0x9A5 : "Ht", #  থ
    0x9A6 : "d", #  দ
    0x9A7 : "Hd", #  ধ
    0x9A8 : "n", #  ন
    0x9A9 : "Q", #  -
    0x9AA : "p", #  প
    0x9AB : "P", #  ফ
    0x9AC : "b", #  ব
    0x9AD : "B", #  ভ
    0x9AE : "m", #  ম
    0x9AF : "y", #  য
    0x9B0 : "r", #  র
    0x9B1 : "R", #  -
    0x9B2 : "l", #  ল
    0x9B3 : "L", #  -
    0x9B4 : "Hz", #  -
    0x9F1 : "v", #  ৱ
    0x9B6 : "S", #  শ
    0x9B7 : "Hs", #  ষ
    0x9B8 : "s", #  স
    0x9B9 : "h", #  হ
    0x9BC : "", #  ়
    0x9BD : "", #  -
    0x9BE : "A", #  া
    0x9BF : "i", #  ি
    0x9C0 : "I", #  ী
    0x9C1 : "u", #  ু
    0x9C2 : "U", #  ু
    0x9C3 : "WR", #  ৃ
    0x9C5 : "WA", #  -
    0x9C6 : "e", #  -
    0x9C7 : "E", #  ে
    0x9C8 : "YE", #  ৈ
    0x9C9 : "WO", #  -
    0x2019 : "o", #  ’
    0x9CB : "O", #  ো
    0x9CC : "YO", #  ৌ
    0x9CD : "q", #  ্
    0x9D8 : "Fk", #  -
    0x9D9 : "FK", #  -
    0x9DA : "Fg", #  -
    0x9DB : "Fj", #  -
    0x9DC : "Fd", #  ড়
    0x9DD : "HR", #  ঢ়
    0x9DE : "FP", #  -
    0x9DF : "Fy", #  য়
     # : "YN", #  -
     # : "HH", #  -
     # : "Yt", #  ৎ
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #

}