#  -*- coding: utf-8 -*-
offset = 0x0900

rev_code = {
    0x901: "M",  # ँ
    0x902: "x",  # ं
    0x903: "X",  # ः
    0x905: "a",  # अ
    0x906: "A",  # आ
    0x907: "i",  # इ
    0x908: "I",  # ई
    0x909: "u",  # उ
    0x90A: "U",  # ऊ
    0x90B: "WR",  # ऋ
    0x90C: "",  #
    0x90D: "WA",  # ऍ
    0x90E: "e",  # ऎ
    0x90F: "E",  # ए
    0x910: "YE",  # ऐ
    0x911: "WO",  # ऑ
    0x912: "o",  # ऒ
    0x913: "O",  # ओ
    0x914: "YO",  # औ
    0x915: "k",  # क
    0x916: "K",  # ख
    0x917: "g",  # ग
    0x918: "G",  # घ
    0x919: "z",  # ङ
    0x91A: "c",  # च
    0x91B: "C",  # छ
    0x91C: "j",  # ज
    0x91D: "J",  # झ
    0x91E: "Z",  # ञ
    0x91F: "T",  # ट
    0x920: "HT",  # ठ
    0x921: "D",  # ड
    0x922: "HD",  # ढ
    0x923: "N",  # ण
    0x924: "t",  # त
    0x925: "Ht",  # थ
    0x926: "d",  # द
    0x927: "Hd",  # ध
    0x928: "n",  # न
    0x929: "Q",  # ऩ
    0x92A: "p",  # प
    0x92B: "P",  # फ
    0x92C: "b",  # ब
    0x92D: "B",  # भ
    0x92E: "m",  # म
    0x92F: "y",  # य
    0x930: "r",  # र
    0x931: "R",  # ऱ
    0x932: "l",  # ल
    0x933: "L",  # ळ
    0x934: "Hz",  # ऴ
    0x935: "v",  # व
    0x936: "S",  # श
    0x937: "Hs",  # ष
    0x938: "s",  # स
    0x939: "h",  # ह
    0x93C: "",  # ़
    0x93D: "",  #
    0x93E: "A",  # ा
    0x93F: "i",  # ि
    0x940: "I",  # ी
    0x941: "u",  # ु
    0x942: "U",  # ू
    0x943: "WR",  # ृ
    0x945: "WA",  # ॅ
    0x946: "e",  # ॆ
    0x947: "E",  # े
    0x948: "YE",  # ै
    0x949: "WO",  # ॉ
    0x94A: "o",  # ॊ
    0x94B: "O",  # ो
    0x94C: "YO",  # ौ
    0x94D: "q",  # ्
    0x958: "Fk",  # क़
    0x959: "FK",  # ख़
    0x95A: "Fg",  # ग़
    0x95B: "Fj",  # ज़
    0x95C: "Fd",  # ड़
    0x95D: "HR",  # ढ़
    0x95E: "FP",  # फ़
    0x95F: "Fy",  # य़
    0x970: "",  #
    0x971: ""  #
}
