# -*- coding: utf-8 -*-
offset = 0x0B00

rev_code = {
    0x0B01 : "M", #  ଁ
    0x0B02 : "x", #  ଂ
    0x0B03 : "X", #  ଃ
    0x0B05 : "a", #  ଅ
    0x0B06 : "A", #  ଆ
    0x0B07 : "i", #  ଇ
    0x0B08 : "I", #  ଈ
    0x0B09 : "u", #  ଉ
    0x0B0A : "U", #  ଊ
    0x0B0B : "WR", #  ଋ
    0x0B0C : "WD", #  ଌ
    0x0B0D : "WA", #  -
    0x0B0E : "e", #  -
    0x0B0F : "E", #  ଏ
    0x0B10 : "YE", #  ଐ
    0x0B11 : "WO", #  -
    0x0B12 : "o", #  -
    0x0B13 : "O", #  ଓ
    0x0B14 : "YO", #  ଔ
    0x0B15 : "k", #  କ
    0x0B16 : "K", #  ଖ
    0x0B17 : "g", #  ଗ
    0x0B18 : "G", #  ଘ
    0x0B19 : "z", #  ଙ
    0x0B1A : "c", #  ଚ
    0x0B1B : "C", #  ଛ
    0x0B1C : "j", #  ଜ
    0x0B1D : "J", #  ଝ
    0x0B1E : "Z", #  ଞ
    0x0B1F : "T", #  ଟ
    0x0B20 : "HT", #  ଠ
    0x0B21 : "D", #  ଡ
    0x0B22 : "HD", #  ଢ
    0x0B23 : "N", #  ଣ
    0x0B24 : "t", #  ତ
    0x0B25 : "Ht", #  ଥ
    0x0B26 : "d", #  ଦ
    0x0B27 : "Hd", #  ଧ
    0x0B28 : "n", #  ନ
    0x0B29 : "Q", #  -
    0x0B2A : "p", #  ପ
    0x0B2B : "P", #  ଫ
    0x0B2C : "b", #  ବ
    0x0B2D : "B", #  ଭ
    0x0B2E : "m", #  ମ
    0x0B5F : "y", #  ୟ
    0x0B30 : "r", #  ର
    0x0B31 : "R", #  -
    0x0B32 : "l", #  ଲ
    0x0B33 : "L", #  ଳ
    0x0B34 : "Hz", #  -
    0x0B71 : "v", #  ୱ
    0x0B36 : "S", #  ଶ
    0x0B37 : "Hs", #  ଷ
    0x0B38 : "s", #  ସ
    0x0B39 : "h", #  ହ
    0x0B3C : "", #  ଼
    0x0B3D : "", #  -
    0x0B3E : "A", #  ା
    0x0B3F : "i", #  ି
    0x0B40 : "I", #  ୀ
    0x0B41 : "u", #  ୁ
    0x0B42 : "U", #  ୂ
    0x0B43 : "WR", #  ୃ
    0x0B45 : "WA", #  -
    0x0B46 : "e", #  -
    0x0B47 : "E", #  େ
    0x0B48 : "YE", #  ୈ
    0x0B49 : "WO", #  -
    0x0B4A : "o", #  -
    0x0B4B : "O", #  ୋ
    0x0B4C : "YO", #  ୌ
    0x0B4D : "q", #  ୍
    0x0B58 : "Fk", #  -
    0x0B59 : "FK", #  -
    0x0B5A : "Fg", #  -
    0x0B5B : "Fj", #  -
    0x0B5C : "Fd", #  ଡ଼
    0x0B5D : "HR", #  ଢ଼
    0x0B5E : "FP", #  -
    0x0B2F : "Fy", #  ଯ
     # : "YN", #
     # : "HH", #
     # : "Yt", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #
     # : "", #

}