#  -*- coding: utf-8 -*-
offset = 0x0980

rev_code = {
    "M" : 0x981, #  ঁ
    "x" : 0x982, #  ং
    "X" : 0x983, #  ঃ
    "a" : 0x985, #  অ
    "A" : 0x986, #  আ
    "i" : 0x987, #  ই
    "I" : 0x988, #  ঈ
    "u" : 0x989, #  উ
    "U" : 0x98A, #  ঊ
    "WR" : 0x98B, #  ঋ
    "WD" : 0x98C, #  -
    "WA" : 0x98D, #  -
    "e" : 0x98E, #  -
    "E" : 0x98F, #  এ
    "YE" : 0x990, #  ঐ
    "WO" : 0x991, #  -
    "o" : 0x992, #  -
    "O" : 0x993, #  ও
    "YO" : 0x994, #  ঔ
    "k" : 0x995, #  ক
    "K" : 0x996, #  খ
    "g" : 0x997, #  গ
    "G" : 0x998, #  ঘ
    "z" : 0x999, #  ঙ
    "c" : 0x99A, #  চ
    "C" : 0x99B, #  ছ
    "j" : 0x99C, #  জ
    "J" : 0x99D, #  ঝ
    "Z" : 0x99E, #  ঞ
    "T" : 0x99F, #  ট
    "HT" : 0x9A0, #  ঠ
    "D" : 0x9A1, #  ড
    "HD" : 0x9A2, #  ঢ
    "N" : 0x9A3, #  ণ
    "t" : 0x9A4, #  ত
    "Ht" : 0x9A5, #  থ
    "d" : 0x9A6, #  দ
    "Hd" : 0x9A7, #  ধ
    "n" : 0x9A8, #  ন
    "Q" : 0x9A9, #  -
    "p" : 0x9AA, #  প
    "P" : 0x9AB, #  ফ
    "b" : 0x9AC, #  ব
    "B" : 0x9AD, #  ভ
    "m" : 0x9AE, #  ম
    "y" : 0x9AF, #  য
    "r" : 0x9F0, #  ৰ
    "R" : 0x9B1, #  -
    "l" : 0x9B2, #  ল
    "L" : 0x9B3, #  -
    "Hz" : 0x9B4, #  -
    "v" : 0x9F1, #  ৱ
    "S" : 0x9B6, #  শ
    "Hs" : 0x9B7, #  ষ
    "s" : 0x9B8, #  স
    "h" : 0x9B9, #  হ
    # "" : 0x9BC, #  ়
    # "" : 0x9BD, #  -
    # "A" : 0x9BE, #  া
    # "i" : 0x9BF, #  ি
    # "I" : 0x9C0, #  ী
    # "u" : 0x9C1, #  ু
    # "U" : 0x9C2, #  ু
    # "WR" : 0x9C3, #  ৃ
    # "WA" : 0x9C5, #  -
    # "e" : 0x9C6, #  -
    # "E" : 0x9C7, #  ে
    # "YE" : 0x9C8, #  ৈ
    # "WO" : 0x9C9, #  -
    # "o" : 0x2019, #  ’
    # "O" : 0x9CB, #  ো
    # "YO" : 0x9CC, #  ৌ
    "q" : 0x9CD, #  ্
    "Fk" : 0x9D8, #  -
    "FK" : 0x9D9, #  -
    "Fg" : 0x9DA, #  -
    "Fj" : 0x9DB, #  -
    "Fd" : 0x9DC, #  ড়
    "HR" : 0x9DD, #  ঢ়
    "FP" : 0x9DE, #  -
    "Fy" : 0x9DF, #  য়
    # "YN" : , #  -
    # "HH" : , #  -
    "Yt" : 0x9CE, #  ৎ
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #

}
