#  -*- coding: utf-8 -*-
offset = 0x0B00

rev_code = {
    "M" : 0x0B01, #  ଁ
    "x" : 0x0B02, #  ଂ
    "X" : 0x0B03, #  ଃ
    "a" : 0x0B05, #  ଅ
    "A" : 0x0B06, #  ଆ
    "i" : 0x0B07, #  ଇ
    "I" : 0x0B08, #  ଈ
    "u" : 0x0B09, #  ଉ
    "U" : 0x0B0A, #  ଊ
    "WR" : 0x0B0B, #  ଋ
    "WD" : 0x0B0C, #  ଌ
    "WA" : 0x0B0D, #  -
    "e" : 0x0B0E, #  -
    "E" : 0x0B0F, #  ଏ
    "YE" : 0x0B10, #  ଐ
    "WO" : 0x0B11, #  -
    "o" : 0x0B12, #  -
    "O" : 0x0B13, #  ଓ
    "YO" : 0x0B14, #  ଔ
    "k" : 0x0B15, #  କ
    "K" : 0x0B16, #  ଖ
    "g" : 0x0B17, #  ଗ
    "G" : 0x0B18, #  ଘ
    "z" : 0x0B19, #  ଙ
    "c" : 0x0B1A, #  ଚ
    "C" : 0x0B1B, #  ଛ
    "j" : 0x0B1C, #  ଜ
    "J" : 0x0B1D, #  ଝ
    "Z" : 0x0B1E, #  ଞ
    "T" : 0x0B1F, #  ଟ
    "HT" : 0x0B20, #  ଠ
    "D" : 0x0B21, #  ଡ
    "HD" : 0x0B22, #  ଢ
    "N" : 0x0B23, #  ଣ
    "t" : 0x0B24, #  ତ
    "Ht" : 0x0B25, #  ଥ
    "d" : 0x0B26, #  ଦ
    "Hd" : 0x0B27, #  ଧ
    "n" : 0x0B28, #  ନ
    "Q" : 0x0B29, #  -
    "p" : 0x0B2A, #  ପ
    "P" : 0x0B2B, #  ଫ
    "b" : 0x0B2C, #  ବ
    "B" : 0x0B2D, #  ଭ
    "m" : 0x0B2E, #  ମ
    "y" : 0x0B5F, #  ୟ
    "r" : 0x0B30, #  ର
    "R" : 0x0B31, #  -
    "l" : 0x0B32, #  ଲ
    "L" : 0x0B33, #  ଳ
    "Hz" : 0x0B34, #  -
    "v" : 0x0B71, #  ୱ
    "S" : 0x0B36, #  ଶ
    "Hs" : 0x0B37, #  ଷ
    "s" : 0x0B38, #  ସ
    "h" : 0x0B39, #  ହ
    # "" : 0x0B3C, #  ଼
    # "" : 0x0B3D, #  -
    # "A" : 0x0B3E, #  ା
    # "i" : 0x0B3F, #  ି
    # "I" : 0x0B40, #  ୀ
    # "u" : 0x0B41, #  ୁ
    # "U" : 0x0B42, #  ୂ
    # "WR" : 0x0B43, #  ୃ
    # "WA" : 0x0B45, #  -
    # "e" : 0x0B46, #  -
    # "E" : 0x0B47, #  େ
    # "YE" : 0x0B48, #  ୈ
    # "WO" : 0x0B49, #  -
    # "o" : 0x0B4A, #  -
    # "O" : 0x0B4B, #  ୋ
    # "YO" : 0x0B4C, #  ୌ
    "q" : 0x0B4D, #  ୍
    "Fk" : 0x0B58, #  -
    "FK" : 0x0B59, #  -
    "Fg" : 0x0B5A, #  -
    "Fj" : 0x0B5B, #  -
    "Fd" : 0x0B5C, #  ଡ଼
    "HR" : 0x0B5D, #  ଢ଼
    "FP" : 0x0B5E, #  -
    "Fy" : 0x0B2F, #  ଯ
    # "YN" : , #
    # "HH" : , #
    # "Yt" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #
    # "" : , #



}
