#  -*- coding: utf-8 -*-
offset = 0x0D00

rev_code = {
    "M" : 0x0D01, #  -
    "x" : 0x0D02, #  ം
    "X" : 0x0D03, #  ഃ
    "a" : 0x0D05, #  അ
    "A" : 0x0D06, #  ആ
    "i" : 0x0D07, #  ഇ
    "I" : 0x0D08, #  ഈ
    "u" : 0x0D09, #  ഉ
    "U" : 0x0D0A, #  ഊ
    "WR" : 0x0D0B, #  ഋ
    # "WD" : , #  -
    # "WA" : , #  -
    "e" : 0x0D0E, #  എ
    "E" : 0x0D0F, #  ഏ
    "YE" : 0x0D10, #  ഐ
    # "WO" : , #  -
    "o" : 0x0D12, #  ഒ
    "O" : 0x0D13, #  ഓ
    "YO" : 0x0D14, #  ഔ
    "k" : 0x0D15, #  ക
    "K" : 0x0D16, #  ഖ
    "g" : 0x0D17, #  ഗ
    "G" : 0x0D18, #  ഘ
    "z" : 0x0D19, #  ങ
    "c" : 0x0D1A, #  ച
    "C" : 0x0D1B, #  ഛ
    "j" : 0x0D1C, #  ജ
    "J" : 0x0D1D, #  ഝ
    "Z" : 0x0D1E, #  ഞ
    "T" : 0x0D1F, #  ട
    "HT" : 0x0D20, #  ഠ
    "D" : 0x0D21, #  ഡ
    "HD" : 0x0D22, #  ഢ
    "N" : 0x0D23, #  ണ
    "t" : 0x0D24, #  ത
    "Ht" : 0x0D25, #  ഥ
    "d" : 0x0D26, #  ദ
    "Hd" : 0x0D27, #  ധ
    "n" : 0x0D28, #  ന
    # "Q" : , #  -
    "p" : 0x0D2A, #  പ
    "P" : 0x0D2B, #  ഫ
    "b" : 0x0D2C, #  ബ
    "B" : 0x0D2D, #  ഭ
    "m" : 0x0D2E, #  മ
    "y" : 0x0D2F, #  യ
    "r" : 0x0D30, #  ര
    "R" : 0x0D31, #  റ
    "l" : 0x0D32, #  ല
    "L" : 0x0D33, #  ള
    "Hz" : 0x0D34, #  ഴ
    "v" : 0x0D35, #  വ
    "S" : 0x0D36, #  ശ
    "Hs" : 0x0D37, #  ഷ
    "s" : 0x0D38, #  സ
    "h" : 0x0D39, #  ഹ
    # "" : , #
    # "" : , #
    # "A" : 0x0D3E, #  ാ
    # "i" : 0x0D3F, #  ി
    # "I" : 0x0D40, #  ീ
    # "u" : 0x0D41, #  ു
    # "U" : 0x0D42, #  ൂ
    # "WR" : , #
    # "WA" : , #
    # "e" : 0x0D46, #  െ
    # "E" : 0x0D47, #  േ
    # "YE" : , #  ൈ
    # "WO" : , #
    # "o" : 0x0D4A, #  ൊ
    # "O" : 0x0D4B, #  ോ
    # "YO" : , #
    # "q" : , #  ്
    # "Fk" : , #
    # "FK" : , #
    # "Fg" : , #
    # "Fj" : , #
    # "Fd" : , #
    "HR" : 0x0D43, #  ൃ
    # "FP" : , #
    # "Fy" : , #
    # "YN" : , #
    # "HH" : , #
    # "Yt" : , #
    # "" : 0x0D48, #
    # "" : 0x0D7A, #  ണ്‍
    "Hn" : 0x0D7B, #  ന്‍
    # "" : 0x0D7C, #  ര്‍
    "HL" : 0x0D7D, #  ല്‍
    # # "" : , #
    "Hl" : 0x0D7E, #  ള്‍
    # "" : 0x0D7F, #  ക്‍
    # # "" : , #
    # "" : , #
    # "" : , #

}
